Repository: rosix-ru/django-reportapi
Catalog: reportapi/locale/*/LC_MESSAGES/django.po
Languages: ru

source: Error in template
ru: Ошибка в шаблоне

source: *Returns the schema ReportAPI for the user.*
ru: *Возвращает схему ReportAPI для пользователя.*

source: Reporting
ru: Отчётность

source: *Starts the process of creating a report and/or returns information about an already running process.*
ru: *Запускает создание отчёта и/или возвращаетинформацию об уже запущенном процессе.*

source: identification section name
ru: идентификационное название раздела

source: identification report name
ru: идентификационное название отчёта

source: filters for processing the result (optional)
ru: фильтры для обработки результата (необязательно)

source: force the creation of the report (optional)
ru: принудительное создание отчёта (необязательно)

source: for finished documents simulates the creation of new (optional)
ru: для готовых документов имитирует создание нового (необязательно)

source: Information about the process
ru: Информация о процессе

source: Grigoriy Kramarenko
ru: Григорий Крамаренко

source: or creation date
ru: либо дата создания

source: when taken already existing old report
ru: когда взят уже существующий старый отчёт

source: or description of the error
ru: или описание ошибки

source: estimated time of waiting for the result in milliseconds
ru: расчётное время ожидания результата в миллисекундах

source: *Returns information about a specific running or the completed report at the specified identification number, either other identification data.*
ru: *Возвращает информацию об определённом запущенном или завершённом отчёте по заданному идентификационному номеру, либо по другим идентификационным данным.*

source: report identificator
ru: идентификатор отчёта

source: Information about the process of report generation
ru: Информация о процессе формирования отчёта

source: *Deletes the document at the specified identification number.*
ru: *Удаляет документ по указанному идентификатору.*

source: *Searches for filling the object filter an instance of the related model.*
ru: *Производит поиск для заполнения объектного фильтра экземпляром связанной модели.*

source: the filter name for the related model
ru: имя фильтра для связанной модели

source: the search query (optional)
ru: поисковый запрос (необязательно)

source: page number (optional)
ru: номер страницы (необязательно)

source: The serialized object to the page of Paginator
ru: Сериализованный объект страницы паджинатора

source: First object
ru: Первый объект

source: Second object
ru: Второй объект

source: *This is the standard output, which can be overridden separately for each report.*
ru: *Это стандартный вывод, который может быть переопределён отдельно для каждого отчёта.*

source: Project
ru: Проект

source: Abstract error
ru: Абстрактная ошибка

source: Validation error
ru: Ошибка проверки

source: Access denied
ru: Доступ запрещён

source: One ore more objects not found
ru: Один или более объектов не найдены

source: isnull
ru: пусто

source: empty
ru: пусто

source: exact
ru: равно

source: iexact
ru: равно (без регистра)

source: gt
ru: больше чем

source: gte
ru: больше или равно

source: lt
ru: меньше чем

source: lte
ru: меньше или равно

source: range
ru: диапазон

source: in
ru: в списке

source: contains
ru: содержит (с регистром)

source: icontains
ru: содержит

source: startswith
ru: начало (с регистром)

source: istartswith
ru: начало

source: endswith
ru: конец (с регистром)

source: iendswith
ru: конец

source: yes
ru: да

source: no
ru: нет

source: any
ru: любое

source: truth
ru: истина

source: Object search
ru: Поиск объекта

source: Y-m-d
ru: d.m.Y

source: Y-m-d H:i
ru: d.m.Y H:i

source: Y-m-d H:i:s
ru: d.m.Y H:i:s

source: Choice
ru: Выберите

source: Select weekday
ru: Выберите день недели

source: Select month
ru: Выберите месяц

source: Today
ru: Сегодня

source: Tomorrow
ru: Завтра

source: Day after tomorrow
ru: Послезавтра

source: Yesterday
ru: Вчера

source: Two days ago
ru: Позавчера

source: Next two days
ru: Следующие 2 дня

source: Next three days
ru: Следующие 3 дня

source: Last two days
ru: Последние два дня

source: Last three days
ru: Последние три дня

source: Current week
ru: Текущая неделя

source: Next week
ru: Следующая неделя

source: Previous week
ru: Предыдущая неделя

source: Current month
ru: Текущий месяц

source: Next month
ru: Следующий месяц

source: Previous month
ru: Предыдущий месяц

source: First quarter
ru: Первый квартал

source: Second quarter
ru: Второй квартал

source: Third quarter
ru: Третий квартал

source: Fourth quarter
ru: Четвёртый квартал

source: First half year
ru: Первое полугодие

source: Second half year
ru: Второе полугодие

source: Current year
ru: Текущий год

source: Next year
ru: Следующий год

source: Previous year
ru: Предыдущий год

source: Function `%s` not found in reportapi.utils.periods
ru: Функция `%s` не обнаружена в reportapi.utils.periods

source: Select period
ru: Выберите период

source: system user
ru: системный пользователь

source: main
ru: основные

source: Attribute `%s` most be string in English without digits, spaces and hyphens.
ru: Атрибут `%s` должен быть строкой на английском языке без цифр, пробелов и дефисов.

source: Attribute `filters` most be list or tuple.
ru: Атрибут `filters` должен быть списком или кортежем.

source: Attribute `title` most be string in English without translation.
ru: Атрибут `title` должен быть строкой на английском языке без перевода.

source: no empty
ru: не пусто

source: %(label)s: from %(cond0)s to %(cond1)s
ru: %(label)s: от %(cond0)s до %(cond1)s

source: Unspecified render error in template.
ru: Неопределённая ошибка рендеринга шаблона.

source: The filters contain errors: (%s)
ru: Фильтры содержат ошибку: (%s)

source: Exceeded the maximum (%(max)s) file size: %(size)s byte.
ru: Превышен максимальный (%(max)s) размер файла: %(size)s байт.

source: section
ru: раздел

source: name
ru: имя

source: title without translation
ru: название без перевода

source: allow all users
ru: доступно всем пользователям

source: allow list users
ru: доступно списку пользователей

source: allow list groups
ru: доступно списку групп

source: max of timeout
ru: максимальное время ожидания

source: registered report
ru: зарегистрированный отчёт

source: registered reports
ru: зарегистрированные отчёты

source: user
ru: пользователь

source: restriction
ru: ограничение

source: process key
ru: ключ процесса

source: error message
ru: сообщение об ошибке

source: start create
ru: начало создания

source: end create
ru: конец создания

source: report file
ru: файл отчёта

source: report file in ODF
ru: файл отчёта в ODF

source: report file in PDF
ru: файл отчёта в PDF

source: title
ru: название

source: description
ru: описание

source: details
ru: детали

source: generated report
ru: сгенерированный отчет

source: generated reports
ru: сгенерированные отчеты

source: Administration
ru: Админка

source: Users
ru: Пользователи

source: Sites
ru: Сайты

source: Content types
ru: Тип содержимого

source: Excuse, the page isn't found.
ru: Извините, страница не найдена.

source: Internal error of the server.
ru: Внутренняя ошибка сервера

source: Project administrator will consider in the near future this a bug.
ru: Администратор проекта рассмотрит ошибку в ближайшее время.

source: ReportAPI - it's easy mechanism building reports in Django projects.
ru: ReportAPI - это простой мезханизм построения отчётов в проектах Django.

source: Toggle navigation
ru: Переключение навигации

source: List reports
ru: Список отчётов

source: version
ru: версия

source: Generated «ReportAPI»
ru: Сгенерировано «ReportAPI»

source: Page
ru: Страница

source: of
ru: из

source: Sheet
ru: Лист

source: Filters
ru: Фильтры

source: Table Filters
ru: Таблица фильтров

source: condition
ru: условие

source: value
ru: значение

source: Table of data
ru: Таблица данных

source: Please, replace block
ru: Пожалуйста, замените блок

source: in your template...
ru: в вашем шаблоне...

source: Print
ru: Печать

source: formed
ru: сформировано

source: Create New
ru: Создать новый

source: Last formed documents
ru: Последние сформированные документы

source: in the making
ru: создаётся

source: Author
ru: Автор

source: Links
ru: Ссылки

source: View
ru: Просмотр

source: Download
ru: Скачать

source: Remove
ru: Удалить

source: Choose report and create document
ru: Выберите отчёт и создайте документ

source: Ready documents
ru: Готовые документы

source: default value
ru: значение по-умолчанию

source: filter required
ru: фильтр обязателен

source: select the condition
ru: выберите условие

source: Create document
ru: Создать документ

source: Recreate document
ru: Пересоздать документ

source: List of reports in section
ru: Список отчётов в разделе

source: Bug!
ru: Ошибка!

source: Attention!
ru: Внимание!

source: Message.
ru: Сообщение.

source: see the log in the JavaScript console
ru: смотрите лог в консоли JavaScript

source: from
ru: от

source: to
ru: до

source: Anonymous
ru: Аноним

source: Section (%s) not found.
ru: Раздел (%s) не найден.

source: Section (%s) not found or not allowed.
ru: Раздел (%s) не найден либо недоступен.

source: Report or register not found for section (%s).
ru: Отчёт либо регистратор не найдены для раздела (%s).

source: Report or register not found for section (%(section)s) and name (%(name)s).
ru: Отчёт либо регистратор не найдены для раздела (%(section)s) и имени (%(name)s).

source: Document (%s) not found or not allowed.
ru: Документ (%s) не найден либо недоступен.
